quest_system_258221870_name=^?^Dirty Butory's Debt
quest_system_258221870_stage_0=^?^Find and kill Dirty Butory.
quest_system_258221870_stage_1=^?^Go back to Bagaba to collect the reward.
quest_system_258221870_stage_2=^?^Tell Bagaba about the feigned death of Butory.
quest_system_258221870_task=^?^Bagaba asks you to kill his debtor, the robber Dirty Butory, who lurks somewhere not far from this place.<br>[reward]
